In [1]:
import pandas as pd

In [53]:
df = pd.read_csv('input/train.csv')

In [54]:
y = df['Survived']

In [55]:
df = df.drop(['Survived'],axis=1)

In [43]:
df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [44]:
df.shape

(891, 11)

In [46]:
df.head(1)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [47]:
df['kfold'] =-1

In [48]:
df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,kfold
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,-1
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,-1
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,-1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,-1
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,-1
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,-1
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,-1
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,-1
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,-1
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,-1

In [56]:
df = df.sample(frac=1)

In [57]:
df.head(5)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
741,742,1,"Cavendish, Mr. Tyrell William",male,36.0,1,0,19877,78.8500,C46,S
224,225,1,"Hoyt, Mr. Frederick Maxfield",male,38.0,1,0,19943,90.0000,C93,S
362,363,3,"Barbara, Mrs. (Catherine David)",female,45.0,0,1,2691,14.4542,NaN,C
528,529,3,"Salonen, Mr. Johan Werner",male,39.0,0,0,3101296,7.9250,NaN,S
414,415,3,"Sundman, Mr. Johan Julian",male,44.0,0,0,STON/O 2. 3101269,7.9250,NaN,S

In [32]:
df.shape

(891, 12)

In [58]:
df = df.sample(frac=1).reset_index()
# This just samples from the shuffled dataset. Frac = 1 means that we want all of the columns, had we
# given frac = 0.2, we would have got 20% of the cols in the sample, i.e, 0<frac<=1. 
# Note that in the above one, even the index values have been shuffled and sampled. We add reset_index
# so that the index gets reset

In [59]:
df

,index,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,189,190,3,"Turcin, Mr. Stjepan",male,36.0,0,0,349247,7.8958,NaN,S
1,278,279,3,"Rice, Master. Eric",male,7.0,4,1,382652,29.1250,NaN,Q
2,777,778,3,"Emanuel, Miss. Virginia Ethel",female,5.0,0,0,364516,12.4750,NaN,S
3,568,569,3,"Doharr, Mr. Tannous",male,NaN,0,0,2686,7.2292,NaN,C
4,151,152,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,219,220,2,"Harris, Mr. Walter",male,30.0,0,0,W/C 14208,10.5000,NaN,S
887,676,677,3,"Sawyer, Mr. Frederick Charles",male,24.5,0,0,342826,8.0500,NaN,S
888,163,164,3,"Calic, Mr. Jovo",male,17.0,0,0,315093,8.6625,NaN,S
889,346,347,2,"Smith, Miss. Marion Elsie",female,40.0,0,0,31418,13.0000,NaN,S
890,222,223,3,"Green, Mr. George Henry",male,51.0,0,0,21440,8.0500,NaN,S

In [ ]:
# Note, the old index did not get dropped, but rather became a column in this sample, so we do a drop = True

In [62]:
df = pd.read_csv('input/train.csv')
y = df['Survived']
df = df.drop(['Survived'],axis=1)

In [63]:
df = df.sample(frac=1).reset_index(drop = True)

In [64]:
df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,413,1,"Minahan, Miss. Daisy E",female,33.0,1,0,19928,90.0000,C78,Q
1,294,3,"Haas, Miss. Aloisia",female,24.0,0,0,349236,8.8500,NaN,S
2,278,2,"Parkes, Mr. Francis ""Frank""",male,NaN,0,0,239853,0.0000,NaN,S
3,465,3,"Maisner, Mr. Simon",male,NaN,0,0,A/S 2816,8.0500,NaN,S
4,431,1,"Bjornstrom-Steffansson, Mr. Mauritz Hakan",male,28.0,0,0,110564,26.5500,C52,S
...,...,...,...,...,...,...,...,...,...,...,...
886,510,3,"Lang, Mr. Fang",male,26.0,0,0,1601,56.4958,NaN,S
887,118,2,"Turpin, Mr. William John Robert",male,29.0,1,0,11668,21.0000,NaN,S
888,220,2,"Harris, Mr. Walter",male,30.0,0,0,W/C 14208,10.5000,NaN,S
889,132,3,"Coelho, Mr. Domingos Fernandeo",male,20.0,0,0,SOTON/O.Q. 3101307,7.0500,NaN,S
890,164,3,"Calic, Mr. Jovo",male,17.0,0,0,315093,8.6625,NaN,S

In [70]:
## STRATIFIED k-fold:
from sklearn import model_selection
kf = model_selection.StratifiedKFold(n_splits=5, shuffle=False, random_state=42)

In [69]:
# What is stratified k-fold?

'''
This cross-validation object is a variation of KFold that returns stratified folds. The folds are made by preserving the percentage of samples for each class
'''

'''
shuffle bool, default=False is an argument:
Whether to shuffle each classâ€™s samples before splitting into batches. Note that the samples within each split will not be shuffled.
'''

'''
split(X, y, groups=None)
Generate INDICES to split data into training and test set.

That is why we do:
for train_idx,val_idx in kf.split(X=df.drop(['Survived'],axis=1) , y = df['Survived']):

    because in every split, we are splitting complete dataset into training and validation data
    we will get a list of indexes for training and testing/validation(our case)
    We will get indexes, say for train we get [12,33,44,678,76,356,234] and validation we get [35,755,789,35]

'''

'\nThis cross-validation object is a variation of KFold that returns stratified folds. The folds are made by preserving the percentage of samples for each class\n'

In [73]:
for fold, (train_idx,val_idx) in enumerate(kf.split(df , y )):
        print(len(train_idx), len(val_idx))

        df.loc[val_idx,'kfold'] = fold

712 179
713 178
713 178
713 178
713 178

In [74]:
# Then we do this to save the k for each data point of training data ( right now i dont know why)
df.loc[val_idx,'kfold'] = fold

In [75]:
df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,kfold
0,413,1,"Minahan, Miss. Daisy E",female,33.0,1,0,19928,90.0000,C78,Q,0.0
1,294,3,"Haas, Miss. Aloisia",female,24.0,0,0,349236,8.8500,NaN,S,0.0
2,278,2,"Parkes, Mr. Francis ""Frank""",male,NaN,0,0,239853,0.0000,NaN,S,0.0
3,465,3,"Maisner, Mr. Simon",male,NaN,0,0,A/S 2816,8.0500,NaN,S,0.0
4,431,1,"Bjornstrom-Steffansson, Mr. Mauritz Hakan",male,28.0,0,0,110564,26.5500,C52,S,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,510,3,"Lang, Mr. Fang",male,26.0,0,0,1601,56.4958,NaN,S,4.0
887,118,2,"Turpin, Mr. William John Robert",male,29.0,1,0,11668,21.0000,NaN,S,4.0
888,220,2,"Harris, Mr. Walter",male,30.0,0,0,W/C 14208,10.5000,NaN,S,4.0
889,132,3,"Coelho, Mr. Domingos Fernandeo",male,20.0,0,0,SOTON/O.Q. 3101307,7.0500,NaN,S,4.0
890,164,3,"Calic, Mr. Jovo",male,17.0,0,0,315093,8.6625,NaN,S,4.0